lan1-192.168.1.0
lan2-192.168.2.0
lan3-192.168.3.0


R1#config t
R1(config)#interface FastEthernet0/0
R1(config-if)#ip address 192.168.1.3 255.255.255.0
R1(config-if)#no shutdown
*Mar  1 00:09:50.043: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state t             o up
*Mar  1 00:09:51.043: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthern             et0/0, changed state to up
R1(config-if)#exit
R1(config)#interface FastEthernet 1/0
R1(config-if)#ip address 192.168.3.3 255.255.255.0
R1(config-if)#no shutdown
R1(config-if)#
*Mar  1 00:10:03.279: %LINK-3-UPDOWN: Interface FastEthernet1/0, changed state t             o up
*Mar  1 00:10:04.279: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthern             et1/0, changed state to up
R1(config-if)#exit
R1(config)#interface FastEthernet2/0
R1(config-if)#ip address 192.168.2.3 255.255.255.0
R1(config-if)#no shutdown
R1(config-if)#^Z
*Mar  1 00:10:20.879: %LINK-3-UPDOWN: Interface FastEthernet2/0, changed state t             o up
*Mar  1 00:10:21.879: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthern             et2/0, changed state to up
R1#sh interface brief
*Mar  1 00:10:25.019: %SYS-5-CONFIG_I: Configured from console by console
R1#sh ip interface brief
Interface                  IP-Address      OK? Method Status                Prot             ocol
FastEthernet0/0            192.168.1.3     YES manual up                    up               
FastEthernet1/0            192.168.3.3     YES manual up                    up               
FastEthernet2/0            192.168.2.3     YES manual up                    up     
    
R1(config)#ip route 192.168.3.0 255.255.255.0 192.168.3.2      
R1(config)#interface FastEthernet0/0
R1(config-if)#ip helper-address 192.168.3.2
R1(config-if)#exit
R1(config)#interface FastEthernet2/0
R1(config-if)#ip helper-address 192.168.3.2
R1(config-if)#^Z
*Mar  1 00:49:45.503: %SYS-5-CONFIG_I: Configured from console by console
R1#wr mem
Building configuration...
[OK]



R2#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#interface FastEthernet 0/0
R2(config-if)#ip address 192.168.3.2 255.255.255.0
R2(config-if)#no shutdown
R2(config-if)#
*Mar  1 00:10:36.451: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state to up
*Mar  1 00:10:37.451: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
R2(config-if)#exit
R2(config)#ip dhcp pool lan1_pool
R2(dhcp-config)#network 192.168.1.0 255.255.255.0
R2(dhcp-config)#default-router 192.168.1.3
R2(dhcp-config)#dns-server 8.8.8.8
R2(dhcp-config)#lease 10
R2(dhcp-config)#exit
R2(config)#ip dhcp pool lan2_pool
R2(dhcp-config)#network 192.168.2.0 255.255.255.0
R2(dhcp-config)#default-router 192.168.2.3
R2(dhcp-config)#dns-server 8.8.8.8
R2(dhcp-config)#lease 10
R2(dhcp-config)#exit
R2(config)#ip dhcp excluded-address 192.168.1.3
R2(config)#ip dhcp excluded-address 192.168.2.3
R2(config)#ip route 192.168.1.0 255.255.255.0 192.168.3.3
R2(config)#ip route 192.168.2.0 255.255.255.0 192.168.3.3
R2#sh ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

S    192.168.1.0/24 [1/0] via 192.168.3.3
S    192.168.2.0/24 [1/0] via 192.168.3.3
C    192.168.3.0/24 is directly connected, FastEthernet0/0
R2#wr mem
Building configuration...
[OK]


PC1> ip dhcp
DDORA IP 192.168.1.1/24 GW 192.168.1.3
PC1> ping 192.168.1.2

84 bytes from 192.168.1.2 icmp_seq=1 ttl=64 time=8.843 ms
84 bytes from 192.168.1.2 icmp_seq=2 ttl=64 time=0.678 ms
84 bytes from 192.168.1.2 icmp_seq=3 ttl=64 time=0.629 ms
84 bytes from 192.168.1.2 icmp_seq=4 ttl=64 time=7.494 ms
^C
PC1> sh ip

NAME        : PC1[1]
IP/MASK     : 192.168.1.1/24
GATEWAY     : 192.168.1.3
DNS         : 8.8.8.8
DHCP SERVER : 192.168.3.2
DHCP LEASE  : 863893, 864000/432000/756000
MAC         : 00:50:79:66:68:00
LPORT       : 20588
RHOST:PORT  : 127.0.0.1:20589
MTU         : 1500

PC1> ping 192.168.2.1
84 bytes from 192.168.2.1 icmp_seq=1 ttl=63 time=26.775 ms
84 bytes from 192.168.2.1 icmp_seq=2 ttl=63 time=15.141 ms
84 bytes from 192.168.2.1 icmp_seq=3 ttl=63 time=15.009 ms
84 bytes from 192.168.2.1 icmp_seq=4 ttl=63 time=14.861 ms
^C
PC1> ping 192.168.2.2
84 bytes from 192.168.2.2 icmp_seq=1 ttl=63 time=24.467 ms
84 bytes from 192.168.2.2 icmp_seq=2 ttl=63 time=16.562 ms
84 bytes from 192.168.2.2 icmp_seq=3 ttl=63 time=13.820 ms


PC4> ip dhcp
DDORA IP 192.168.2.2/24 GW 192.168.2.3

PC4> ping 192.168.2.1
84 bytes from 192.168.2.1 icmp_seq=1 ttl=64 time=0.544 ms
84 bytes from 192.168.2.1 icmp_seq=2 ttl=64 time=5.822 ms
84 bytes from 192.168.2.1 icmp_seq=3 ttl=64 time=0.651 ms
84 bytes from 192.168.2.1 icmp_seq=4 ttl=64 time=5.888 ms
^C
PC4> ping 192.168.1.2
84 bytes from 192.168.1.2 icmp_seq=1 ttl=63 time=22.850 ms
84 bytes from 192.168.1.2 icmp_seq=2 ttl=63 time=15.492 ms
84 bytes from 192.168.1.2 icmp_seq=3 ttl=63 time=15.047 ms
84 bytes from 192.168.1.2 icmp_seq=4 ttl=63 time=14.842 ms